In [1]:
####pandas series

import pandas as p
import numpy as n

In [2]:
data=n.array(['g','o','e','f'])
data

array(['g', 'o', 'e', 'f'], dtype='<U1')

In [3]:
ser=p.Series(data)   #series datatype
print(ser)

0    g
1    o
2    e
3    f
dtype: object

In [12]:
s1=p.Series(n.random.randn(5))   #crearing random no.series
print(s1)

0    1.092555
1    0.100391
2    1.887412
3   -0.121856
4    0.632802
dtype: float64

In [13]:
print(s1.index)

RangeIndex(start=0, stop=5, step=1)

In [15]:
s2=p.Series(n.random.randn(5),index=['a','e','o','r','w']) #creating index on our own
print(s2)

a    0.140770
e    0.136813
o   -0.534983
r   -0.778958
w    0.828072
dtype: float64

data={'pi':3.14,'e':2.13}
print(data)
s3=p.Series(data)
print(s3)

In [20]:
s4=p.Series(data,index=['pi','e','a']) #dictionary
print(s4)

pi     NaN
e     2.13
a      NaN
dtype: float64

In [21]:
s5=p.Series(1,index=range(10),name='ones')  #series of a single number
print(s5)

0    1
1    1
2    1
3    1
4    1
5    1
6    1
7    1
8    1
9    1
Name: ones, dtype: int64

In [22]:
s1

0    1.092555
1    0.100391
2    1.887412
3   -0.121856
4    0.632802
dtype: float64

In [23]:
data={'pi':3.14,'e':2.13}
print(data)
s6=p.Series(data)
print(s6)

{'pi': 3.14, 'e': 2.13}
pi    3.14
e     2.13
dtype: float64

In [25]:
s7=p.Series(data,index=['pi','e','a']) #dictionary
print(s7)  #nan=not a number

pi    3.14
e     2.13
a      NaN
dtype: float64

In [29]:
print(s1)    #slicing in series
s1[3]

0    1.092555
1    0.100391
2    1.887412
3   -0.121856
4    0.632802
dtype: float64

-0.12185625582847195

In [27]:
s7['pi']

3.14

In [30]:
s1[:2]

0    1.092555
1    0.100391
dtype: float64

In [31]:
dir(s7)

['T',
 '_AXIS_ALIASES',
 '_AXIS_IALIASES',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_AXIS_SLICEMAP',
 '__abs__',
 '__add__',
 '__and__',
 '__array__',
 '__array_prepare__',
 '__array_priority__',
 '__array_wrap__',
 '__bool__',
 '__bytes__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__float__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__int__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__long__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__unicode__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_only_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_see_also_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_binop',
 '_box_item_values',
 '_builtin_table',
 '_can_hold_na',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_percentile',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_dict_for_slice',
 '_construct_axes_dict_from',
 '_construct_axes_from_arguments',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_create_indexer',
 '_cython_table',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_expand_axes',
 '_find_valid_index',
 '_formatting_values',
 '_from_axes',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_get_values',
 '_get_values_tuple',
 '_get_with',
 '_gotitem',
 '_iget_item_cache',
 '_index',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_init_dict',
 '_init_mgr',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_copy',
 '_is_cython_func',
 '_is_datelike_mixed_type',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_numeric_mixed_type',
 '_is_view',
 '_ix',
 '_ixs',
 '_map_values',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_ndarray_values',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_indexer',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_repr_data_resource_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_set_labels',
 '_set_name',
 '_set_subtyp',
 '_set_value',
 '_set_values',
 '_set_with',
 '_set_with_engine',
 '_setup_axes',
 '_shallow_copy',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_take',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_unpickle_series_compat',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 '_xs',
 'a',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'argmax',
 'argmin',
 'argsort',
 'array',
 'as_matrix',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'autocorr',
 'axes',
 'base',
 'between',
 'between_time',
 'bfill',
 'bool',
 'clip',
 'clip_lower',
 'clip_upper',
 'combine',
 'combine_first',
 'compound',
 'compress',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'data',
 'describe',
 'diff',
 'div',
 'divide',
 'divmod',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtype',
 'dtypes',
 'duplicated',
 'e',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'factorize',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'from_array',
 'ftype',
 'ftypes',
 'ge',
 'get',
 'get_dtype_counts',
 'get_ftype_counts',
 'get_values',
 'groupby',
 'gt',
 'hasnans',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'imag',
 'index',
 'infer_objects',
 'interpolate',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'items',
 'itemsize',
 'iteritems',
 'ix',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'nbytes',
 'ndim',
 'ne',
 'nlargest',
 'nonzero',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pi',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'ptp',
 'put',
 'quantile',
 'radd',
 'rank',
 'ravel',
 'rdiv',
 'rdivmod',
 'real',
 'reindex',
 'reindex_axis',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'repeat',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'searchsorted',
 'select',
 'sem',
 'set_axis',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'std',
 'strides',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'timetuple',
 'to_clipboard',
 'to_csv',
 'to_dense',
 'to_dict',
 'to_excel',
 'to_frame',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_list',
 'to_msgpack',
 'to_numpy',
 'to_period',
 'to_pickle',
 'to_sparse',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs']

In [32]:
print(s1)
print("median:",s1.median())

0    1.092555
1    0.100391
2    1.887412
3   -0.121856
4    0.632802
dtype: float64
median: 0.6328020579211174

In [34]:
print(s1)
s1[s1>0]

0    1.092555
1    0.100391
2    1.887412
3   -0.121856
4    0.632802
dtype: float64

0    1.092555
1    0.100391
2    1.887412
4    0.632802
dtype: float64

In [36]:
s1[s1>s1.median()]

0    1.092555
2    1.887412
dtype: float64

In [38]:
#vector opeartions
print(s1)
n.exp(s1)

0    1.092555
1    0.100391
2    1.887412
3   -0.121856
4    0.632802
dtype: float64

0    2.981883
1    1.105603
2    6.602258
3    0.885276
4    1.882879
dtype: float64

In [40]:
rs=p.Series(n.random.randn(25)) 
print(rs)

0     0.374097
1     0.561178
2     0.665921
3     1.291739
4    -1.657341
5    -2.199030
6     0.494553
7    -1.640462
8    -0.400076
9     1.691567
10   -2.566753
11   -0.256326
12    0.805240
13    1.148872
14    0.260435
15    0.718534
16    0.575106
17    0.073857
18    0.528592
19    1.836175
20   -1.390480
21   -1.580258
22    1.438491
23   -0.649969
24   -0.843958
dtype: float64

In [42]:
rs.head(10)

0    0.374097
1    0.561178
2    0.665921
3    1.291739
4   -1.657341
5   -2.199030
6    0.494553
7   -1.640462
8   -0.400076
9    1.691567
dtype: float64

In [43]:
rs.tail()

20   -1.390480
21   -1.580258
22    1.438491
23   -0.649969
24   -0.843958
dtype: float64

In [46]:
rs.tail(7)

18    0.528592
19    1.836175
20   -1.390480
21   -1.580258
22    1.438491
23   -0.649969
24   -0.843958
dtype: float64

In [48]:
rs.size

25

In [49]:
rs.dtype

dtype('float64')

In [50]:
rs.empty   #true only if series is empty

False

In [51]:
rs.values

array([ 0.37409662,  0.56117817,  0.66592146,  1.29173931, -1.65734117,
       -2.19903032,  0.4945532 , -1.64046188, -0.40007588,  1.69156697,
       -2.56675322, -0.25632648,  0.80524022,  1.14887216,  0.26043494,
        0.71853389,  0.57510579,  0.07385668,  0.52859249,  1.83617466,
       -1.39047976, -1.58025775,  1.43849148, -0.64996894, -0.8439584 ])

In [52]:
##pandas dataframes

In [54]:
d= p.DataFrames({'name':p.Sereis(['shubh','shubhkiller']),
                  'Age':p.Series([19,20])})
print(d)

AttributeError: module 'pandas' has no attribute 'DataFrames'

In [56]:
df=p.read_csv("G://programs//Salaries.csv")

In [57]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [58]:
df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [59]:
df.tail(5)

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [60]:
type(df)  #identify type of df

pandas.core.frame.DataFrame

In [61]:
df['salary'].dtype  #identify type of column salary

dtype('int64')

In [62]:
df.dtypes  #type of all columns

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [63]:
df.shape

(78, 6)

In [64]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [14]:
import pandas as p
import numpy as n

In [15]:
df=p.read_csv("G://programs//Salaries.csv")

In [17]:
df.axes #list row lables and columns

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [18]:
df.size

468

In [19]:
df.ndim #no of dimensions

2

In [20]:
df.shape

(78, 6)

df.describe() #basic stats for numeric columns

In [22]:
df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [23]:
df.std() #standard deviation

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [26]:
df['salary'].mean() #for a particular column

108023.78205128205

In [29]:
df['salary'].std()

28293.661022264165

In [38]:
df.head(50).mean() #average of first 50 columns

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [40]:
df['sex'].head(10)

0    Male
1    Male
2    Male
3    Male
4    Male
5    Male
6    Male
7    Male
8    Male
9    Male
Name: sex, dtype: object

In [41]:
df['salary'].describe() #basic stats for salary column

count        78.000000
mean     108023.782051
std       28293.661022
min       57800.000000
25%       88612.500000
50%      104671.000000
75%      126774.750000
max      186960.000000
Name: salary, dtype: float64

In [43]:
df_sex=df.groupby('sex')

In [49]:
df['salary'].count()

78

In [46]:
df['salary'].mean()

108023.78205128205

In [47]:
df_rank=df.groupby('rank')

In [48]:
df_rank.mean() #mean of all numeric columns for grouped object

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [53]:
df_sex=df.groupby('sex')

In [66]:
df.groupby('sex')['salary'].mean()  #mean salary for men and women

sex
Female    101002.410256
Male      115045.153846
Name: salary, dtype: float64

In [61]:
df_discipline=df.groupby('discipline')

In [71]:
df.griup['salary'].mean()

SyntaxError: invalid syntax (<ipython-input-71-65c91fc891dc>, line 1)

In [67]:
df.groupby('sex')[['salary']].mean()#double braces panda

               salary
sex
Female  101002.410256
Male    115045.153846

In [70]:
#group using 2 variable sex and women
df.groupby(['rank','sex'])[['salary']].mean()

                         salary
rank      sex
AssocProf Female   88512.800000
          Male    102697.666667
AsstProf  Female   78049.909091
          Male     85918.000000
Prof      Female  121967.611111
          Male    124690.142857

In [73]:
df.groupby('discipline')[['salary']].mean() #groupby discipline and finding salary for the same

                   salary
discipline
A            98331.111111
B           116331.785714

In [74]:
#filtering

In [79]:
df_sub=df[df['salary']>120000] #abbv with the value in salary >120k
print(df_sub.head(10))
print(df_sub.count())

    rank discipline  phd  service   sex  salary
0   Prof          B   56       49  Male  186960
3   Prof          A   40       31  Male  131205
5   Prof          A   20       20  Male  122400
7   Prof          A   18       18  Male  126300
10  Prof          B   39       33  Male  128250
11  Prof          B   23       23  Male  134778
13  Prof          B   35       33  Male  162200
14  Prof          B   25       19  Male  153750
15  Prof          B   17        3  Male  150480
19  Prof          A   29       27  Male  150500
rank          25
discipline    25
phd           25
service       25
sex           25
salary        25
dtype: int64

In [77]:
df_sub.axes

[Int64Index([ 0,  3,  5,  7, 10, 11, 13, 14, 15, 19, 26, 27, 29, 31, 35, 36, 39,
             40, 44, 45, 49, 51, 58, 72, 75],
            dtype='int64'),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [80]:
df_w=df[df['sex']=='Female']  #selecting data for female professors

df_w.head()

         rank discipline  phd  service     sex  salary
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000

In [89]:
df[df['discipline']=='A'][['salary']].mean() #using filtering find mean value for the salary for discipline A

salary    98331.111111
dtype: float64

In [96]:
#abbv with high salary(>100k)
#how many male and female proffessors in each group
df[df['salary']>100000].groupby('sex').count()

        rank  discipline  phd  service  salary
sex
Female    21          21   21       21      21
Male      25          25   25       25      25

In [97]:
#more on slicing the dataset
df1=df['salary']

In [98]:
type(df1)

pandas.core.series.Series

In [99]:
df1.head()

0    186960
1     93000
2    110515
3    131205
4    104800
Name: salary, dtype: int64

In [106]:
df2=df[['salary']]  #making output to be a dataframe

In [107]:
type(df2)

pandas.core.frame.DataFrame

In [102]:
df[0:10]

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [103]:
df.loc[10:20,['rank','salary']] #selecting both rows and columns we can use method.loc

        rank  salary
10      Prof  128250
11      Prof  134778
12  AsstProf   88000
13      Prof  162200
14      Prof  153750
15      Prof  150480
16  AsstProf   75044
17  AsstProf   92000
18      Prof  107300
19      Prof  150500
20  AsstProf   92000

In [104]:
df_sub.head(10)

    rank discipline  phd  service   sex  salary
0   Prof          B   56       49  Male  186960
3   Prof          A   40       31  Male  131205
5   Prof          A   20       20  Male  122400
7   Prof          A   18       18  Male  126300
10  Prof          B   39       33  Male  128250
11  Prof          B   23       23  Male  134778
13  Prof          B   35       33  Male  162200
14  Prof          B   25       19  Male  153750
15  Prof          B   17        3  Male  150480
19  Prof          A   29       27  Male  150500

In [108]:
df_sub.loc[10:20,['rank','salary']]

    rank  salary
10  Prof  128250
11  Prof  134778
13  Prof  162200
14  Prof  153750
15  Prof  150480
19  Prof  150500

In [109]:
df_sub.iloc[10:20,[0,3,4,5]]  #selecting rows and columns if we dont have headers

    rank  service     sex  salary
26  Prof       19    Male  148750
27  Prof       43    Male  155865
29  Prof       20    Male  123683
31  Prof       21    Male  155750
35  Prof       23    Male  126933
36  Prof       45    Male  146856
39  Prof       18  Female  129000
40  Prof       36  Female  137000
44  Prof       19  Female  151768
45  Prof       25  Female  140096

In [110]:
#sorting th data

In [118]:
df_sort=df.sort_values(by='service')  #creating data frame by yrs.service and create a new dta frame
df_sort.head()

        rank discipline  phd  service     sex  salary
55  AsstProf          A    2        0  Female   72500
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000

In [126]:
df.sort_values(by='service',ascending=False)  #creating data frame by yrs.ervice and overwrite the original data_frame
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [121]:
df.sort_index(axis=0,ascending=True) #restoring original order
df.head

<bound method NDFrame.head of          rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
5        Prof          A   20       20    Male  122400
6   AssocProf          A   20       17    Male   81285
7        Prof          A   18       18    Male  126300
8        Prof          A   29       19    Male   94350
9        Prof          A   51       51    Male   57800
10       Prof          B   39       33    Male  128250
11       Prof          B   23       23    Male  134778
12   AsstProf          B    1        0    Male   88000
13       Prof          B   35       33    Male  162200
14       Prof          B   25       19    Male  153750
15       Prof          B   17        3    Male  150480
16   AsstProf          B    8        3    Male   75044
17   AsstProf          B    4        0    Male   92000
18       Prof          A   19        7    Male  107300
19       Prof          A   29       27    Male  150500
20   AsstProf          B    4        4    Male   92000
21       Prof          A   33       30    Male  103106
22   AsstProf          A    4        2    Male   73000
23   AsstProf          A    2        0    Male   85000
24       Prof          A   30       23    Male   91100
25       Prof          B   35       31    Male   99418
26       Prof          A   38       19    Male  148750
27       Prof          A   45       43    Male  155865
28   AsstProf          B    7        2    Male   91300
29       Prof          B   21       20    Male  123683
..        ...        ...  ...      ...     ...     ...
48       Prof          B   17       17  Female  111512
49       Prof          B   17       18  Female  122960
50   AsstProf          B   10        5  Female   97032
51       Prof          B   20       14  Female  127512
52       Prof          A   12        0  Female  105000
53   AsstProf          A    5        3  Female   73500
54  AssocProf          A   25       22  Female   62884
55   AsstProf          A    2        0  Female   72500
56  AssocProf          A   10        8  Female   77500
57   AsstProf          A    3        1  Female   72500
58       Prof          B   36       26  Female  144651
59  AssocProf          B   12       10  Female  103994
60   AsstProf          B    3        3  Female   92000
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
63       Prof          A   29       27  Female   91000
64  AssocProf          A   26       24  Female   73300
65       Prof          A   36       19  Female  117555
66   AsstProf          A    7        6  Female   63100
67       Prof          A   17       11  Female   90450
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]>

In [128]:
#sorting the data farme by salary(in descending order)
df_sort=df.sort_values(by='salary') 
df_sort.head

         rank discipline  phd  service     sex  salary
9        Prof          A   51       51    Male   57800
54  AssocProf          A   25       22  Female   62884
66   AsstProf          A    7        6  Female   63100
71  AssocProf          B   12        9  Female   71065
57   AsstProf          A    3        1  Female   72500

In [133]:
#sorting the data farme by salary(in descending order)
df.sort_values(by='salary',ascending=False).head()

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
13  Prof          B   35       33    Male  162200
72  Prof          B   24       15  Female  161101
27  Prof          A   45       43    Male  155865
31  Prof          B   22       21    Male  155750

In [135]:
df_sort=df.sort_values(by=['service','salary'],ascending=[True,False])  #sort the dataframes using 2 or more columns
df_sort.head(10)

        rank discipline  phd  service     sex  salary
52      Prof          A   12        0  Female  105000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
55  AsstProf          A    2        0  Female   72500
57  AsstProf          A    3        1  Female   72500
28  AsstProf          B    7        2    Male   91300
42  AsstProf          B    4        2  Female   80225
68  AsstProf          A    4        2  Female   77500

In [136]:
fl=p.read_csv("G://programs//flights.csv")

In [137]:
fl.size

2572064

In [139]:
fl.head()

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
0,2013,1,1,517.0,2.0,830.0,11.0,UA,N14228,1545,EWR,IAH,227.0,1400,5.0,17.0
1,2013,1,1,533.0,4.0,850.0,20.0,UA,N24211,1714,LGA,IAH,227.0,1416,5.0,33.0
2,2013,1,1,542.0,2.0,923.0,33.0,AA,N619AA,1141,JFK,MIA,160.0,1089,5.0,42.0
3,2013,1,1,554.0,-6.0,812.0,-25.0,DL,N668DN,461,LGA,ATL,116.0,762,5.0,54.0
4,2013,1,1,554.0,-4.0,740.0,12.0,UA,N39463,1696,EWR,ORD,150.0,719,5.0,54.0

In [140]:
fl.max()

year         2013
month          12
day            31
dep_time     2400
dep_delay    1014
arr_time     2400
arr_delay    1007
carrier        US
flight       2599
origin        LGA
dest          TPA
air_time      695
distance     4963
hour           24
minute         59
dtype: object

In [142]:
fl[fl.isnull().any(axis=1)].head() #selecting rows having one missing value

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
330,2013,1,1,1807.0,29.0,2251.0,NaN,UA,N31412,1228,EWR,SAN,NaN,2425,18.0,7.0
403,2013,1,1,NaN,NaN,NaN,NaN,AA,N3EHAA,791,LGA,DFW,NaN,1389,NaN,NaN
404,2013,1,1,NaN,NaN,NaN,NaN,AA,N3EVAA,1925,LGA,MIA,NaN,1096,NaN,NaN
855,2013,1,2,2145.0,16.0,NaN,NaN,UA,N12221,1299,EWR,RSW,NaN,1068,21.0,45.0
858,2013,1,2,NaN,NaN,NaN,NaN,AA,NaN,133,JFK,LAX,NaN,2475,NaN,NaN

In [160]:
fl1=fl[fl['arr_delay'].notnull()] #arr_delay value missing in rows
fl1.head(3)

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
0,2013,1,1,517.0,2.0,830.0,11.0,UA,N14228,1545,EWR,IAH,227.0,1400,5.0,17.0
1,2013,1,1,533.0,4.0,850.0,20.0,UA,N24211,1714,LGA,IAH,227.0,1416,5.0,33.0
2,2013,1,1,542.0,2.0,923.0,33.0,AA,N619AA,1141,JFK,MIA,160.0,1089,5.0,42.0

In [153]:
fl2=fl.dropna()#remove all abbv with missing values
fl2.head(3)

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
0,2013,1,1,517.0,2.0,830.0,11.0,UA,N14228,1545,EWR,IAH,227.0,1400,5.0,17.0
1,2013,1,1,533.0,4.0,850.0,20.0,UA,N24211,1714,LGA,IAH,227.0,1416,5.0,33.0
2,2013,1,1,542.0,2.0,923.0,33.0,AA,N619AA,1141,JFK,MIA,160.0,1089,5.0,42.0

In [149]:
nomiss=fl['dep_delay'].fillna(0) #fill missing values with zeroes
nomiss.isnull().any()

False

In [152]:
nomiss=fl['arr_delay'].fillna(1)
nomiss.isnull().any()

False

In [151]:
nomiss=fl['air_time'].fillna(0)
nomiss.isnull().any()

False

In [170]:
fl[fl.isnull()][['arr_delay']].count() #count how many missing values are there in arr_delay

arr_delay    0
dtype: int64

In [169]:
fl[fl.isnull()][['dep_delay']].count() #count how many missing values are there in dep_delay

dep_delay    0
dtype: int64

In [172]:
fl.describe().head(2) #no of non missing values in each column

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,flight,air_time,distance,hour,minute
count,160754.0,160754.000000,160754.000000,158418.000000,158418.000000,158275.000000,157927.000000,160754.000000,157927.000000,160754.00000,158418.000000,158418.000000
mean,2013.0,6.547395,15.716567,1316.146006,9.463773,1517.471161,2.094537,1156.344987,180.685158,1282.44542,12.837582,32.387847

In [177]:
fl.count().head(2)

year     160754
month    160754
dtype: int64

In [185]:
fl.mad().head(2)  #mean absolute deviation

year     0.000000
month    2.951582
dtype: float64

In [ ]:
#fumctions like count sum mad median mode prod=product of values std var=unbiased variance

In [183]:
fl['dep_delay'].isnull().sum() #count how many missing values are there in dep_delay

2336

In [184]:
fl['arr_delay'].isnull().sum() #count how many missing values are there in arr_delay

2827

In [186]:
ff=fl[fl['arr_delay'].isnull()]  #count how many missing values are there in arr_delay (using count)
ff['arr_delay'].isnull().count()

2827

In [187]:
fl.groupby('carrier')[['dep_delay']].mean()  #computing summary stats for a group

         dep_delay
carrier
AA        8.586016
AS        5.804775
DL        9.264505
UA       12.106073
US        3.782418

In [191]:
fl[['year']].median()

year    2013.0
dtype: float64

In [ ]:
#agg() aggregation

In [192]:
fl[['dep_delay','arr_delay']].agg(['min','mean','max'])

        dep_delay    arr_delay
min    -33.000000   -75.000000
mean     9.463773     2.094537
max   1014.000000  1007.000000

In [200]:
fl.agg({'dep_delay':['min','mean','max'],'carrier':['unique']}) #computing different statistics for different columns

          dep_delay               carrier
max     1014.000000                   NaN
mean       9.463773                   NaN
min      -33.000000                   NaN
unique          NaN  [UA, AA, DL, US, AS]

In [197]:
fl.agg({'dep_delay':['min','mean',max],'carrier':['nunique']})

           dep_delay  carrier
max      1014.000000      NaN
mean        9.463773      NaN
min       -33.000000      NaN
nunique          NaN      5.0

In [201]:
fl[['dep_delay']].idxmin()  #index of max or min value

dep_delay    54111
dtype: int64

In [204]:
fl['carrier'].value_counts()  #no of recrds for each diff value in vector

UA    58665
DL    48110
AA    32729
US    20536
AS      714
Name: carrier, dtype: int64